app/Http/Controllers/ApiAuthController.php

select * from "users" where "email" = 'barathonien@mail.fr' limit 1
---
    public function login(LoginUserRequest $request)
    {
        $request->validated($request->only(['email', 'password']));

        if(!Auth::attempt($request->only(['email', 'password']))) {
            return $this->error('', 'Credentials do not match', 401);
        }

        $user = User::where('email', $request->email)->first();

insert into "users" ("first_name", "last_name", "email", "password", "updated_at", "created_at") values ('Bastien', 'Girardin-Vincent', 'bastien52300@hotmail.fr', '$2y$10$LcokeHo0X44QNNWWUvDlBusQgQ1cl4IMwI4enz0RAxPzbxLjjReai', '2022-11-23 20:55:51', '2022-11-23 20:55:51') returning "user_id"
---
    public function register(Request $request)
    {
        $request->validate([
            'first_name' => 'required|string|max:255',
            'last_name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:users',
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'first_name' => $request->first_name,
            'last_name' => $request->last_name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);

delete from "personal_access_tokens" where "id" = 2
---
    public function logout()
    {
        Auth::user()->currentAccessToken()->delete();